# Pandas - DataFrame and Series
Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A series is a 1-Dimensional array like object, while a DataFrame is a 2-Dimensional, size-mutable, and potentially heterogeneou tabular data structure with labeled axes(rows and columns).

In [1]:
! pip install pandas

Requirement already satisfied: pandas in e:\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in e:\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in e:\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in e:\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in e:\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in e:\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [12]:
import pandas as pd

In [13]:
#  Series
# A pandas series is a 1-Dimensional array like object that can hold any data type. It is similar to a column in a table.
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series\n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [14]:
#  Create a series from dictionary elements
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [15]:
# Different index

data=[10,20,30]
index=['a','b','c']

pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [16]:
# Data frame
#  create a dataframe from a dictionary of list

data={
    'Name':['Abhishek','Jack','John'],
    'Age':[25,30,45],
    'City':['Bangalore','New York','Florida']
}

df=pd.DataFrame(data)
print(df)
print(type(df))

       Name  Age       City
0  Abhishek   25  Bangalore
1      Jack   30   New York
2      John   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [17]:
#  Create a dataframe from list of dictionaries

data=[
    {'Name':'Abhishek','age':32,'City':'Bangalore'},
    {'Name':'John','age':32,'City':'Bangalore'},
    {'Name':'Tony','age':32,'City':'Bangalore'},
    {'Name':'Jack','age':32,'City':'Bangalore'}
]

df=pd.DataFrame(data)
print(df)

       Name  age       City
0  Abhishek   32  Bangalore
1      John   32  Bangalore
2      Tony   32  Bangalore
3      Jack   32  Bangalore

In [27]:
df=pd.read_csv('SalesData.csv')

# top 5 records
df.head(5)

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode
0,B-25681,1096,658,7,Electronics,Electronic Games,COD
1,B-26055,5729,64,14,Furniture,Chairs,EMI
2,B-25955,2927,146,8,Furniture,Bookcases,EMI
3,B-26093,2847,712,8,Electronics,Printers,Credit Card
4,B-25602,2617,1151,4,Electronics,Phones,Credit Card

In [28]:
# last 5 records
df.tail(5)

     Order ID  Amount  Profit  Quantity     Category Sub-Category PaymentMode
1495  B-25700       7      -3         2     Clothing  Hankerchief         COD
1496  B-25757    3151     -35         7     Clothing     Trousers         EMI
1497  B-25973    4141    1698        13  Electronics     Printers         COD
1498  B-25698       7      -2         1     Clothing  Hankerchief         COD
1499  B-25993    4363     305         5    Furniture       Tables         EMI

In [31]:
#  Accessing data from dataframe
df=pd.DataFrame(data)
df

       Name  age       City
0  Abhishek   32  Bangalore
1      John   32  Bangalore
2      Tony   32  Bangalore
3      Jack   32  Bangalore

In [32]:
df['Name']

0    Abhishek
1        John
2        Tony
3        Jack
Name: Name, dtype: object

In [33]:
type(df['Name'])

pandas.core.series.Series

In [58]:
df.loc[0]               # row index

Name     Abhishek
age            32
City    Bangalore
Name: 0, dtype: object

In [59]:
df.iloc[0]

Name     Abhishek
age            32
City    Bangalore
Name: 0, dtype: object

In [60]:
df.loc[0][0]

C:\Users\abhis\AppData\Local\Temp\ipykernel_17996\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Abhishek'

In [61]:
df.iloc[0][1]

C:\Users\abhis\AppData\Local\Temp\ipykernel_17996\2309508539.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][1]

32

In [62]:
## Accessing Specified Element

df

       Name  age       City
0  Abhishek   32  Bangalore
1      John   32  Bangalore
2      Tony   32  Bangalore
3      Jack   32  Bangalore

In [63]:
df.at[1,'Name']

'John'

In [64]:
# Accessing specified element using iat
df.iat[2,0]

'Tony'

In [65]:
# Data Manipulation with Data Frames
df

       Name  age       City
0  Abhishek   32  Bangalore
1      John   32  Bangalore
2      Tony   32  Bangalore
3      Jack   32  Bangalore

In [66]:
# Adding a column
df['Salary']=[10000,20000,30000,40000]

In [67]:
df

       Name  age       City  Salary
0  Abhishek   32  Bangalore   10000
1      John   32  Bangalore   20000
2      Tony   32  Bangalore   30000
3      Jack   32  Bangalore   40000

In [68]:
# Removing a column
df.drop('Salary',axis=1,inplace=True)

In [69]:
df

       Name  age       City
0  Abhishek   32  Bangalore
1      John   32  Bangalore
2      Tony   32  Bangalore
3      Jack   32  Bangalore

In [71]:
# Add age tothe column
df['age']=df['age']+1
df

       Name  age       City
0  Abhishek   33  Bangalore
1      John   33  Bangalore
2      Tony   33  Bangalore
3      Jack   33  Bangalore

In [72]:
df.drop(0)         # not a permanent operation

   Name  age       City
1  John   33  Bangalore
2  Tony   33  Bangalore
3  Jack   33  Bangalore

In [73]:
df

       Name  age       City
0  Abhishek   33  Bangalore
1      John   33  Bangalore
2      Tony   33  Bangalore
3      Jack   33  Bangalore

In [74]:
df.drop(0,inplace=True)

In [75]:
df

   Name  age       City
1  John   33  Bangalore
2  Tony   33  Bangalore
3  Jack   33  Bangalore

In [76]:
df=pd.read_csv('SalesData.csv')

In [77]:
df

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode
0,B-25681,1096,658,7,Electronics,Electronic Games,COD
1,B-26055,5729,64,14,Furniture,Chairs,EMI
2,B-25955,2927,146,8,Furniture,Bookcases,EMI
3,B-26093,2847,712,8,Electronics,Printers,Credit Card
4,B-25602,2617,1151,4,Electronics,Phones,Credit Card
...,...,...,...,...,...,...,...
1495,B-25700,7,-3,2,Clothing,Hankerchief,COD
1496,B-25757,3151,-35,7,Clothing,Trousers,EMI
1497,B-25973,4141,1698,13,Electronics,Printers,COD
1498,B-25698,7,-2,1,Clothing,Hankerchief,COD
1499,B-25993,4363,305,5,Furniture,Tables,EMI

In [78]:
df.describe()

            Amount      Profit     Quantity
count  1500.000000  1500.00000  1500.000000
mean    291.847333    24.64200     3.743333
std     461.924620   168.55881     2.184942
min       4.000000 -1981.00000     1.000000
25%      47.750000   -12.00000     2.000000
50%     122.000000     8.00000     3.000000
75%     326.250000    38.00000     5.000000
max    5729.000000  1864.00000    14.000000